
var dict = {
	// 人稱代名詞
	'你': '泥',	'妳': '泥',	'我': '窩',
	// 助詞
	'的': 'ㄉ',	'呵': 'ㄏ',	'喔': 'ㄛ',
	'吧': 'ㄅ',	'嗎': 'ㄇ',	'之': 'ㄓ',
	'阿': 'ㄚ',	'啊': 'ㄚ',	'呢': 'ㄋ',
	'了': 'ㄌ',	'子' : 'ㄗ',
	// 副詞
	'得': 'ㄉ',	'是': '4',	'不': '咘',
	'最': '罪',	'很': '狠',
	// 數量詞
	'一': 'yee',
	'隻': 'ㄓ',
	'個': 'ㄍ',
	//
	'好': '毫',
	'看': '抗',
	'知': 'ㄓ',
	'說': '縮',
	'歌': 'ㄍ',
	'哥': 'ㄍ',
	'無': '5',
	'傘': '3',
	'愛': 'i',
	'就' : '揪',
	'吃' : 'ㄘ',
	// 短語
	'星' : '☆',
	'走吧' : '98',
	'廢物': 'ㄈㄨ',
	'喜歡': '洗翻',
	'這樣': '醬',
	'加油' : '+u',
	'什麼' : '神馬',
	'幹你媽的' : 'ㄍㄋㄇㄉ',
	'漂亮' : '漂釀',
	'大大' : 'ㄉㄉ',
	'台灣' : '呆丸',
	'臺灣' : '呆丸',


	//轉回來
	'目ㄉ': '目的',
	'ㄌ解': '了解'
};
