
var dict = {
	// 人稱代名詞
	'你': '尼',	'妳': '倪',	'我': '窩',
	'們': '悶',
	// 助詞
	'的': 'ㄉ',	'呵': 'ㄏ',	'喔': 'ㄛ',
	'吧': 'ㄅ',	'嗎': 'ㄇ',	'之': 'ㄓ',
	'阿': 'ㄚ',	'啊': 'ㄚ',	'呢': 'ㄋ',
	'了': 'ㄌ',	'子': 'ㄗ',	'嘛': 'ㄇ',
	'那': 'ㄋ',	'啦': 'ㄌ',	'哈': 'ㄏ',
	// 副詞
	'得': 'ㄉ',	'是': '４',	'不': '咘',
	'最': '罪',	'很': '狠',	'好': '毫',
	'就': '啾',	'有': 'Ｕ',
	// 數量詞
	'一': 'yee',
	'隻': 'ㄓ',
	'個': 'ㄍ',
	// 動詞
	'看': '抗',	'喝': 'ㄏ',	'吃': 'ㄘ',
	'說': '縮',	'愛': 'ｉ',
	'知': 'ㄓ',
	'歌': 'ㄍ',
	'無': '５',
	'出': '粗',
	'來': '乃',
	'去': '企',
	'玩': '丸',
	// 名詞
	'哥': 'ㄍ',
	'傘': '３',
	'東西': '東ㄒ',
	'星' : '☆',
	'大大' : 'ㄉㄉ',
	'台灣' : '呆丸',
	'臺灣' : '呆丸',
	// 形容詞
	'漂亮' : '漂釀',
	'可愛' : '口ｉ',
	'喜歡': '洗翻',
	// 短語
	'謝謝': '３Ｑ',
	'走吧' : '９８',
	'廢物': 'ㄈㄨ',
	'這樣': '醬',
	'加油' : '＋ｕ',
	'什麼' : '神馬',
	'幹你媽的' : 'ㄍㄋㄇㄉ',
	'出遊': '七逃',


	//轉回來
	'目ㄉ': '目的',
	'ㄌ解': '了解'
};
